public class FiguresPrintln {
    public static void main(String[] args) {
        System.out.printf("" +
                "\nТреугольник    " +
                "\n       *       " +
                "\n      ***      " +
                "\n     *****     " +
                "\n    *******    " +
                "\n   *********   " +
                "\n  ***********  " +
                "\n ************* " +
                "\n***************" +
                "\n ");
        System.out.printf("" +
                "\nТупоугольный треугольник" +
                "\n*      " +
                "\n**     " +
                "\n***    " +
                "\n****   " +
                "\n*****  " +
                "\n****** " +
                "\n*******" +
                "\n ");
        System.out.printf("" +
                "\nПеревернутый тупоугольный треугольник" +
                "\n*******" +
                "\n****** " +
                "\n*****  " +
                "\n****   " +
                "\n***    " +
                "\n**     " +
                "\n*      " +
                "\n ");
        System.out.printf("" +
                "\nКривая" +
                "\n*        " +
                "\n *       " +
                "\n  *      " +
                "\n   *     " +
                "\n    *    " +
                "\n     *   " +
                "\n      *  " +
                "\n       * " +
                "\n");
        System.out.printf("" +
                "\nКривая №2" +
                "\n        *" +
                "\n       * " +
                "\n      *  " +
                "\n     *   " +
                "\n    *    " +
                "\n   *     " +
                "\n  *      " +
                "\n *       " +
                "\n");
        System.out.printf("" +
                "\nОвал" +
                "\n           **          " +
                "\n      *          *     " +
                "\n   *                *  " +
                "\n *                    *" +
                "\n *                    *" +
                "\n   *                *  " +
                "\n      *          *     " +
                "\n           **          " +
                "\n");
        System.out.printf("" +
                "\nРомб    " +
                "\n        *        " +
                "\n       ***       " +
                "\n      *****      " +
                "\n     *******     " +
                "\n    *********    " +
                "\n   ***********   " +
                "\n  *************  " +
                "\n *************** " +
                "\n*****************" +
                "\n *************** " +
                "\n  *************  " +
                "\n   ***********   " +
                "\n    *********    " +
                "\n     *******     " +
                "\n      *****      " +
                "\n       ***       " +
                "\n        *        " +
                "\n");
        System.out.printf("" +
                "\nПрямоугольник    " +
                "\n * * * * *" +
                "\n * * * * *" +
                "\n * * * * *" +
                "\n * * * * *" +
                "\n * * * * *" +
                "\n * * * * *" +
                "\n * * * * *" +
                "\n * * * * *" +
                "\n");
        System.out.printf("" +
                "\nПолый треугольник    " +
                "\n       *       " +
                "\n      * *      " +
                "\n     *   *     " +
                "\n    *     *    " +
                "\n   *       *   " +
                "\n  *         *  " +
                "\n *           * " +
                "\n***************" +
                "\n ");
        System.out.printf("" +
                "\n Полый тупоугольный треугольник" +
                "\n*      " +
                "\n**     " +
                "\n* *    " +
                "\n*  *   " +
                "\n*   *  " +
                "\n*    * " +
                "\n*******" +
                "\n ");
        System.out.printf("" +
                "\nПолый перевернутый тупоугольный треугольник" +
                "\n*******" +
                "\n*    * " +
                "\n*   *  " +
                "\n*  *   " +
                "\n* *    " +
                "\n**     " +
                "\n*      " +
                "\n ");
        System.out.printf("" +
                "\nПолый ромб    " +
                "\n        *        " +
                "\n       * *       " +
                "\n      *   *      " +
                "\n     *     *     " +
                "\n    *       *    " +
                "\n   *         *   " +
                "\n  *           *  " +
                "\n *             * " +
                "\n*               *" +
                "\n *             * " +
                "\n  *           *  " +
                "\n   *         *   " +
                "\n    *       *    " +
                "\n     *     *     " +
                "\n      *   *      " +
                "\n       * *       " +
                "\n        *        " +
                "\n");
        System.out.printf("" +
                "\nПолый прямоугольник    " +
                "\n * * * * *" +
                "\n *       *" +
                "\n *       *" +
                "\n *       *" +
                "\n *       *" +
                "\n *       *" +
                "\n *       *" +
                "\n * * * * *" +
                "\n");
    }
}